<?php
namespace Rnr;

class utf8 {
	public static function stripCZ($input) {
		$transtable = array(
		        'ą' => 'a', 'á' => 'a', 'â' => 'a', 'ă' => 'a', 'ä' => 'a',
		        'ć' => 'c', 'ç' => 'c', 'č' => 'c',
		        'ď' => 'd', 'đ' => 'd',
		        'é' => 'e', 'ę' => 'e', 'ë' => 'e', 'ě' => 'e',
		        'í' => 'i', 'î' => 'i',
		        'ĺ' => 'l', 'ł' => 'l',
		        'ń' => 'n', 'ň' => 'n',
		        'ó' => 'o', 'ô' => 'o', 'ő' => 'o', 'ö' => 'o',
		        'ř' => 'r', 'ŕ' => 'r',
		        'š' => 's', 'ś' => 's',
		        'ť' => 't', 'ţ' => 't',
		        'ů' => 'u', 'ú' => 'u', 'ű' => 'u', 'ü' => 'u',
		        'ý' => 'y',
		        'ž' => 'z', 'ź' => 'z',

		        'Ą' => 'A', 'Á' => 'A', 'Â' => 'A', 'Ă' => 'A', 'Ä' => 'A',
		        'Ć' => 'C', 'Ç' => 'C', 'Č' => 'C',
		        'Ď' => 'D', 'Đ' => 'D',
		        'É' => 'E', 'Ę' => 'E', 'Ë' => 'E', 'Ě' => 'E',
		        'Í' => 'I', 'Î' => 'I',
		        'Ĺ' => 'L', 'Ł' => 'L',
		        'Ń' => 'N', 'Ň' => 'N',
		        'Ó' => 'O', 'Ô' => 'O', 'Ő' => 'O', 'Ö' => 'O',
		        'Ř' => 'R', 'Ŕ' => 'R',
		        'Š' => 'S', 'Ś' => 'S',
		        'Ť' => 'T', 'Ţ' => 'T',
		        'Ů' => 'U', 'Ú' => 'U', 'Ű' => 'U', 'Ü' => 'U',
		        'Ý' => 'Y',
		        'Ž' => 'Z', 'Ź' => 'Z'
		        );

		$result=strtr($input,$transtable);
	        return $result;
	}

	public static function cyrilicToLatin($input, $outlang = 'cz') {
		$transtable['cz'] = array(
			'А' => 'A',	'а' => 'a',
			'Б' => 'B',	'б' => 'b',
			'В' => 'V',	'в' => 'v',
			'Г' => 'G',	'г' => 'g',
			'Д' => 'D',	'д' => 'd',
			'Е' => 'Je',	'е' => 'je',
			'Ё' => 'Jo',	'ё' => 'jo',
			'Ж' => 'Ž',	'ж' => 'ž',
			'З' => 'Z',	'з' => 'z',
			'И' => 'I',	'и' => 'i',
			'Й' => 'J',	'й' => 'j',
			'К' => 'K',	'к' => 'k',
			'Л' => 'L',	'л' => 'l',
			'М' => 'M',	'м' => 'm',
			'Н' => 'N',	'н' => 'n',
			'О' => 'O',	'о' => 'o',
			'П' => 'P',	'п' => 'p',
			'Р' => 'R',	'р' => 'r',
			'С' => 'S',	'с' => 's',
			'Т' => 'T',	'т' => 't',
			'У' => 'U',	'у' => 'u',
			'Ф' => 'F',	'ф' => 'f',
			'Х' => 'Ch',	'х' => 'ch',
			'Ц' => 'C',	'ц' => 'c',
			'Ч' => 'Č',	'ч' => 'č',
			'Ш' => 'Š',	'ш' => 'š',
			'Щ' => 'Šč',	'щ' => 'šč',
			'Ъ' => 'Y',	'ъ' => 'y',
			'Ы' => 'Y',	'ы' => 'y',
			'Ь' => 'I',	'ь' => 'i',
			'Э' => 'E',	'э' => 'e',
			'Ю' => 'Ju',	'ю' => 'ju',
			'Я' => 'Ja',	'я' => 'ja'
			);

		$transtable['en'] = array(
			'А' => 'A',	'а' => 'a',
			'Б' => 'B',	'б' => 'b',
			'В' => 'V',	'в' => 'v',
			'Г' => 'G',	'г' => 'g',
			'Д' => 'D',	'д' => 'd',
			'Е' => 'Ye',	'е' => 'Ye',
			'Ё' => 'Yo',	'ё' => 'Yo',
			'Ж' => 'Zh',	'ж' => 'zh',
			'З' => 'Z',	'з' => 'z',
			'И' => 'I',	'и' => 'i',
			'Й' => 'J',	'й' => 'j',
			'К' => 'K',	'к' => 'k',
			'Л' => 'L',	'л' => 'l',
			'М' => 'M',	'м' => 'm',
			'Н' => 'N',	'н' => 'n',
			'О' => 'O',	'о' => 'o',
			'П' => 'P',	'п' => 'p',
			'Р' => 'R',	'р' => 'r',
			'С' => 'S',	'с' => 's',
			'Т' => 'T',	'т' => 't',
			'У' => 'U',	'у' => 'u',
			'Ф' => 'F',	'ф' => 'f',
			'Х' => 'Ch',	'х' => 'ch',
			'Ц' => 'C',	'ц' => 'c',
			'Ч' => 'ch',	'ч' => 'ch',
			'Ш' => 'sh',	'ш' => 'sh',
			'Щ' => 'Stch',	'щ' => 'stch',
			'Ъ' => 'Y',	'ъ' => 'y',
			'Ы' => 'Y',	'ы' => 'y',
			'Ь' => 'I',	'ь' => 'i',
			'Э' => 'E',	'э' => 'e',
			'Ю' => 'Yu',	'ю' => 'yu',
			'Я' => 'Ya',	'я' => 'ya'
			);

		$result=strtr($input,$transtable[$outlang]);
	        return $result;

		}

	public static function toRewrite($input) {
		$input = strtolower(utf8::stripCZ($input));
		$input = preg_replace('/[^0-9A-Za-z]/', ' ', $input);
		$input = trim($input);
		$input = preg_replace('/\s+/', '-', $input);
		return $input;
	}

}
